{
    "page": 1,
    "results": [
        {
            "adult": false,
            "backdrop_path": "/pbrkL804c8yAv3zBZR4QPEafpAR.jpg",
            "genre_ids": [12, 18, 878],
            "id": 157336,
            "original_language": "en",
            "original_title": "Interstellar",
            "overview": "The adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
            "popularity": 148.798,
            "poster_path": "/gEU2QniE6E77NI6lCU6MxlNBvIx.jpg",
            "release_date": "2014-11-05",
            "title": "Interstellar",
            "video": false,
            "vote_average": 8.414,
            "vote_count": 32348
        },
        {
            "adult": false,
            "backdrop_path": null,
            "genre_ids": [35],
            "id": 287954,
            "original_language": "en",
            "original_title": "Lolita from Interstellar Space",
            "overview": "An undeniably beautiful alien is sent to Earth to study the complex mating rituals of human beings, which leads to the young interstellar traveler experiencing the passion that surrounds the centuries-old ritual of the species.",
            "popularity": 3.974,
            "poster_path": "/nhWlip1s5YzhRFKGlHABGJrBhZn.jpg",
            "release_date": "2014-03-08",
            "title": "Lolita from Interstellar Space",
            "video": false,
            "vote_average": 5.4,
            "vote_count": 10
        },
        {
            "adult": false,
            "backdrop_path": null,
            "genre_ids": [28],
            "id": 649745,
            "original_language": "zh",
            "original_title": "星际流浪",
            "overview": "The film tells that the catastrophe era, the earth is a waste land, the survivors are divided into wanderers and civilians, they are attached to the rule of the interstellar armed groups, in which the rogues rely on the plundering of civilian materials as a livelihood, making civilians in this harsh It is difficult to survive in the environment. After a hundred years of black technology explosion, it will bring about a civilized renaissance. In the face of the deteriorating planet, mankind is determined to continue the race and is determined to interstellar immigration. The \"curvature engine\" developed by the Chinese researcher Hailei has become the key to the interstellar immigration, and is also the target of robbers and interstellar armed groups.",
            "popularity": 0.685,
            "poster_path": "/oUWDbde5bWu9syBZglWDIwB1SPm.jpg",
            "release_date": "2019-08-02",
            "title": "Interstellar Wandering",
            "video": false,
            "vote_average": 0.0,
            "vote_count": 0
        },
        {
            "adult": false,
            "backdrop_path": "/wUZID3WzrzuIQmcIjXahZkV1ItI.jpg",
            "genre_ids": [878],
            "id": 398188,
            "original_language": "en",
            "original_title": "Interstellar Wars",
            "overview": "For millennia the Alien force has watched and waited, a brooding menace that has now at last decided to take over the Earth. Communications systems worldwide are sent into chaos by a strange atmospheric interference, a massive spaceship heads towards Earth and smaller spaceships begin to cover entire cities. Suddenly, the wonder turns into horror as the spaceships destroy the cities with energy weapons. When the world counterattacks, the alien ships are invincible to military weapons.  The survivors have to use their wits to kill the aliens, or die.",
            "popularity": 2.598,
            "poster_path": "/4uWZ8cdrXMLiyLNgdmqQCIM6z40.jpg",
            "release_date": "2016-06-09",
            "title": "Interstellar Wars",
            "video": false,
            "vote_average": 3.292,
            "vote_count": 12
        },
        {
            "adult": false,
            "backdrop_path": null,
            "genre_ids": [28, 14, 878],
            "id": 460616,
            "original_language": "en",
            "original_title": "Interstellar Civil War: Shadows of the Empire",
            "overview": "The Imperial Empire is attacked by an Alliance of rebels led by fanatical mystics. The ruler, Empress Nobu, the 8th generation of her family, wants to execute a bold plan to rescue a cyborg, Leah C6, trapped on the battle ravaged planet Endor. The Empress believes Leah C6 holds the secret to destroying the Alliance of Rebels before their insurgency can kill millions of citizens of the Empire. She recruits her heroic fleet commander, Lord General Luka Raan and asks him to gather a team from the Empire's elite soldiers, the Galactic Rangers. Raan assembles the team in the ruins of Endor which was attacked by depraved Rebels and outlaws led by, Kindo-Ker, a fanatical mystic in Dark Energy. The Galactic Rangers begin a desperate search to find and rescue Leah C6 before the Alliance Rebels can.",
            "popularity": 1.498,
            "poster_path": "/1lDY7ZpEKOl3OaIQURjRbmFPfT8.jpg",
            "release_date": "2018-04-15",
            "title": "Interstellar Civil War: Shadows of the Empire",
            "video": false,
            "vote_average": 4.0,
            "vote_count": 1
        },
        {
            "adult": false,
            "backdrop_path": null,
            "genre_ids": [],
            "id": 838389,
            "original_language": "en",
            "original_title": "Interstellar: Desgornia's Cut",
            "overview": "A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.",
            "popularity": 1.96,
            "poster_path": "/geOB25wA6VHSlANpJ1UMyuokjJl.jpg",
            "release_date": "",
            "title": "Interstellar: Desgornia's Cut",
            "video": false,
            "vote_average": 0.0,
            "vote_count": 0
        },
        {
            "adult": false,
            "backdrop_path": null,
            "genre_ids": [35, 18],
            "id": 716603,
            "original_language": "en",
            "original_title": "Only Interstellar Pinball Lives Forever",
            "overview": "A young boy (played by an actual re-purposed Sunday school puppet) loses all faith in religion and afterlife options after having to bury his umpteenth pet, and vows that someday, when he's an adult with money, he'll find a way to become an 'eternal molecule' through science. Then, twenty-two years later, the playing of a pinball game brings dredges up the memory of that vow. Utilizing the hallucinogenic properties of alcohol and cough syrup blends, he undertakes the design of a pinball machine so poignant and dignified that it will convince scientists to create a pinball that we can download our consciousness into and thereby become digitally immortal.",
            "popularity": 0.6,
            "poster_path": "/uLJMGZlrkmvAO9Ria9zrp8GUqjx.jpg",
            "release_date": "2010-06-28",
            "title": "Only Interstellar Pinball Lives Forever",
            "video": false,
            "vote_average": 0.0,
            "vote_count": 0
        },
        {
            "adult": false,
            "backdrop_path": "/ynF37QsffZ1b3Xm2ktpb79ioP6R.jpg",
            "genre_ids": [99],
            "id": 436305,
            "original_language": "en",
            "original_title": "The Farthest",
            "overview": "The captivating tales of the people and events behind one of humanity's greatest achievements in exploration: NASA's Voyager mission.",
            "popularity": 4.717,
            "poster_path": "/jHbSJo4FoKvqaGn3b7q49bcSYVZ.jpg",
            "release_date": "2018-03-15",
            "title": "The Farthest",
            "video": false,
            "vote_average": 7.656,
            "vote_count": 45
        },
        {
            "adult": false,
            "backdrop_path": "/yl9QqtS3tbLCL4e6lHM349joALK.jpg",
            "genre_ids": [28, 53, 878],
            "id": 47663,
            "original_language": "en",
            "original_title": "Trancers 5: Sudden Deth",
            "overview": "Jack Deth is back for one more round with the trancers. Jack must attempt to find his way home from the other-dimensional world of Orpheus, where magic works and the trancers were the ruling class (before Trancers IV, that is). Unfortunately, Jack's quest to find the mystical Tiamond in the Castle of Unrelenting Terror may be thwarted by the return of Caliban, king of the trancers who was thought dead.",
            "popularity": 6.268,
            "poster_path": "/t4to2HtWP1lT6TkvTwSUD7cQqIH.jpg",
            "release_date": "1994-09-10",
            "title": "Trancers 5: Sudden Deth",
            "video": false,
            "vote_average": 4.652,
            "vote_count": 23
        },
        {
            "adult": false,
            "backdrop_path": "/aPXNyG6035Wz2DhtGAgf7PeGNsz.jpg",
            "genre_ids": [878, 28],
            "id": 47662,
            "original_language": "en",
            "original_title": "Trancers 4: Jack of Swords",
            "overview": "Jack is now back in the future. He had since lost Lena, and finds out that he's lost his other wife Alice to none other than Harris. While heading out for another assignment, something goes awry with the TCL chamber. Jack finds himself in a whole new dimension. He also runs across a different version of trancers. These guys seem to be in control of this planet. Jack manages to assist a rebel group known as the \"Tunnel Rats\" crush the rule of the evil Lord Calaban.",
            "popularity": 5.004,
            "poster_path": "/ec081IWKkRalPO14KAmqJ2vWeYB.jpg",
            "release_date": "1994-02-02",
            "title": "Trancers 4: Jack of Swords",
            "video": false,
            "vote_average": 5.148,
            "vote_count": 27
        },
        {
            "adult": false,
            "backdrop_path": null,
            "genre_ids": [878],
            "id": 261443,
            "original_language": "en",
            "original_title": "Angry Planet",
            "overview": "A criminal sentenced to life on a prison planet reveals his true purpose: to extract revenge on the killers who murdered his family.",
            "popularity": 1.152,
            "poster_path": "/6Bv0rl9R5gaN8X58LOjUT4MWKR7.jpg",
            "release_date": "2008-01-01",
            "title": "Angry Planet",
            "video": false,
            "vote_average": 2.8,
            "vote_count": 2
        },
        {
            "adult": false,
            "backdrop_path": "/l94Zv2Yn2BYgfAw19gJRaiJ1PGh.jpg",
            "genre_ids": [28],
            "id": 1042070,
            "original_language": "zh",
            "original_title": "百慕大星际流浪者",
            "overview": "In the year 2055 AD (333 years of the planet Bermuda), an international research flying saucer led by Chinese captain Mo Jiahai was searching for planets with signs of life in space. They found a humanoid planet but ran out of energy while performing space shuttle and could no longer start up just after reaching this planet. The surviving Earthlings found that their bodies' respiratory systems could not fully adapt. Unwilling to pin their hopes entirely on the AI robots, some of the Earthlings endured the uncomfortable air and stepped out of the ship, where they secretly reproduced on the planet. Hundreds of years passed, and the Earthlings who gradually adapted to the planet Bermuda also reproduced secretly from generation to generation, with the secret of the flying saucer buried deep in the desert of the planet.",
            "popularity": 0.712,
            "poster_path": "/mvT8itefntNmKb69IJFA9SjWrdH.jpg",
            "release_date": "2022-10-27",
            "title": "The Bermuda Star Rangers",
            "video": false,
            "vote_average": 3.5,
            "vote_count": 2
        }
    ],
    "total_pages": 1,
    "total_results": 20
}
